In [1]:
import pandas as pd   #importing essential libraries
import numpy as np

In [2]:
data={'NAME':['MAHESH','SURESH','DIVANSH','AJAY','RAM'],    #example dataset
    'Math_score':['89','90','95','78','100'],
     'Science_score':['98','87','89','99','100'],
     'English_score':['99','88','98','90','89'],
     'Hindi_score':['100','98','99','89','98'],}

In [12]:
df=pd.DataFrame(data)     #dataframing
df.index=[1,2,3,4,5]     #reindexing properly

In [13]:
df['Math_score']=pd.to_numeric(df['Math_score'])   #converting object datatye to integer datatype
df['Science_score']=pd.to_numeric(df['Science_score'])
df['English_score']=pd.to_numeric(df['English_score'])
df['Hindi_score']=pd.to_numeric(df['Hindi_score'])

In [14]:
df['TOTALSCORE']=df.iloc[:,1:5].sum(axis=1)    # creatibng new coloumn of totalscore
df['AVERAGESCORE']=df.iloc[:,1:5].mean(axis=1)   # creating new coloumn of average score

In [15]:
df   #dataframe print

,NAME,Math_score,Science_score,English_score,Hindi_score,TOTALSCORE,AVERAGESCORE
1,MAHESH,89,98,99,100,386,96.50
2,SURESH,90,87,88,98,363,90.75
3,DIVANSH,95,89,98,99,381,95.25
4,AJAY,78,99,90,89,356,89.00
5,RAM,100,100,89,98,387,96.75

In [17]:
highest_score_df=df.loc[df['TOTALSCORE'].idxmax()]    #highest total score

In [18]:
highest_score_df  # student details of highest score

NAME               RAM
Math_score         100
Science_score      100
English_score       89
Hindi_score         98
TOTALSCORE         387
AVERAGESCORE     96.75
Name: 5, dtype: object

In [27]:
Average_score=df.iloc[:,[0,6]]    ##average score

In [28]:
Average_score    ## printing of avra

      NAME  AVERAGESCORE
1   MAHESH         96.50
2   SURESH         90.75
3  DIVANSH         95.25
4     AJAY         89.00
5      RAM         96.75